app/Models/V1/Mdl_member.php

    public function add($data)
    {
        try {
            $member = $this->db->table("member");
            $member->insert($data);
            $id     = $this->db->insertID();

            if (!$data['refcode'] && $data['role'] == 'referral') {
                $mdata = array(
                    "refcode"   => substr($this->generate_token($id), 0, 8),
                );
                $member->where("id", $id);
                $member->update($mdata);
---
INSERT INTO `member` (`email`, `passwd`, `role`, `status`, `timezone`, `ip_addr`, `otp`) VALUES ('member@gmail.com', 'd033e22ae348aeb5660fc2140aec35850c4da997', 'member', 'new', 'Asia/Jakarta', '127.0.0.1', 2112)
UPDATE `member` SET `refcode` = 'xrwh4zyj'
WHERE `id` = 143

    public function activate($mdata)
    {
        try {
            // Cari member berdasarkan email dan otp
            $valid = $this->where('email', $mdata['email'])
                ->where('otp', $mdata['otp'])
                ->first();

            if (!$valid) {
                return (object) [
                    'code'    => 400,
                    'message' => 'Invalid token'
                ];
            }

            // Update status menjadi "member"
            $this->set(['status' => 'active', 'otp' => null])
                ->where('email', $mdata['email'])
                ->update();
---
SELECT *
FROM `member`
WHERE `email` = 'member@gmail.com'
AND `otp` = '2112'
 LIMIT 1
UPDATE `member` SET `status` = 'active', `otp` = NULL, `updated_at` = '2025-03-27 15:37:32'
WHERE `email` = 'member@gmail.com'